config/cf/Catalogs/Метрики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Метрики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИзмерений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДополнительноеИзмерениеМетрикиSLA</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНазначенияМетрик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ТипыНазначенияМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыНазначенияМетрик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Catalog.ПотенциальныеКлиенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Comment>Банковский счет по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоУмолчанию</Name>
					<Comment>Договор контрагента по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Местоположения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РемонтСервис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИностранныйКонтрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/Метрики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ПредопределенноеЗначениеПоИдентификатору(Знач ИмяИдентификатора, Перезаполнить = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос        = Новый Запрос();
	Запрос.Текст  =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Метрики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Метрики КАК Метрики
		|ГДЕ
		|	Метрики.Идентификатор = &ИмяИдентификатора";
	
	Запрос.УстановитьПараметр("ИмяИдентификатора", ИмяИдентификатора);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Перезаполнить     	= Истина;
		Спр 				= Справочники.Метрики.СоздатьЭлемент();
		Спр.Идентификатор 	= ИмяИдентификатора;
		Спр.Наименование  	= ИмяИдентификатора;
		Спр.Записать();
		
		Возврат Спр.Ссылка;
		
	КонецЕсли;
	
КонецФункции

// Заполнение структуры метрики
//
Функция ТаблицаСтруктураМетрики() Экспорт
		
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");		
	ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗ.Колонки.Добавить("ЗначениеПоУмолчанию");
	ТЗ.Колонки.Добавить("Описание");
	ТЗ.Колонки.Добавить("Измерения");
	ТЗ.Колонки.Добавить("Родитель");
	
	Возврат ТЗ;
	
КонецФункции

// Поиск и создание группы метрики
//
Функция НайтиСоздатьГруппуМетрики(Знач ИмяИдентификатора, Знач ИмяГруппы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Метрики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Метрики КАК Метрики
		|ГДЕ
		|	Метрики.Идентификатор = &Идентификатор
		|	И Метрики.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Идентификатор", ИмяИдентификатора);	
	РезультатЗапроса       = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Спр = Справочники.Метрики.СоздатьГруппу();
		Спр.Идентификатор = ИмяИдентификатора;
		Спр.Наименование  = ИмяГруппы;
		Спр.Записать();
		
		Возврат Спр.Ссылка;
		
	КонецЕсли;
	
КонецФункции

// Заполнение метрик
//
Процедура ЗаполнитьМетрикиДокументЗадание(ТЗ) Экспорт
	
	ЕдШт			= Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(796);	
	ГруппаЗадания 	= НайтиСоздатьГруппуМетрики("Задание", "Документ Задание");
	
	#Область КоличествоВыполненныхЗаданий	
	НоваяСтрока		= МетрикиДобавитьВТаблицуЗначений(ТЗ,
						 ПредопределенноеЗначениеПоИдентификатору("КоличествоВыполненныхЗаданий"),
						 НСтр("ru = 'Количество выполненных заданий'"),
						 ЕдШт,
						 ,
						 НСтр("ru = 'Все не помеченные на удаление выполненные задания.'"),
						 ГруппаЗадания);
	ДобавитьКолонкиВИзмерения(НоваяСтрока.Измерения);					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.ПотенциальныеКлиенты;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Инициатор'"),
			НСтр("ru = 'Инициатор задания'"));					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Клиент'"),
			НСтр("ru = 'Клиент'"));
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.ГруппыПользователей;Справочник.Пользователи;",
			НСтр("ru = 'Исполнитель'"),
			НСтр("ru = 'Исполнитель задания'"),
			,
			,
			Перечисления.ТипыНазначенияМетрик.Пользователь);
	#КонецОбласти
	
	#Область КоличествоНераспределенныхЗаданий	
	НоваяСтрока		= МетрикиДобавитьВТаблицуЗначений(ТЗ,
						 ПредопределенноеЗначениеПоИдентификатору("КоличествоНераспределенныхЗаданий"),
						 НСтр("ru = 'Количество нераспределенных заданий'"),
						 ЕдШт,
						 ,
						 НСтр("ru = 'Все не помеченные на удаление задания, в которых исполнитель не указан.'"),
						 ГруппаЗадания);
	ДобавитьКолонкиВИзмерения(НоваяСтрока.Измерения);					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.ПотенциальныеКлиенты;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Инициатор'"),
			НСтр("ru = 'Инициатор задания'"));					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Клиент'"),
			НСтр("ru = 'Клиент'"));
	#КонецОбласти
	
	#Область КоличествоОткрытыхЗаданий	
	НоваяСтрока		= МетрикиДобавитьВТаблицуЗначений(ТЗ,
						 ПредопределенноеЗначениеПоИдентификатору("КоличествоОткрытыхЗаданий"),
						 НСтр("ru = 'Количество открытых заданий'"),
						 ЕдШт,
						 ,
						 НСтр("ru = 'Все не помеченные на удаление не выполненные задания.'"),
						 ГруппаЗадания);
	ДобавитьКолонкиВИзмерения(НоваяСтрока.Измерения);					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.ПотенциальныеКлиенты;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Инициатор'"),
			НСтр("ru = 'Инициатор задания'"));					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Клиент'"),
			НСтр("ru = 'Клиент'"));
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.ГруппыПользователей;Справочник.Пользователи;",
			НСтр("ru = 'Исполнитель'"),
			НСтр("ru = 'Исполнитель задания'"),
			,
			,
			Перечисления.ТипыНазначенияМетрик.Пользователь);
	#КонецОбласти
	
	#Область КоличествоПросроченныхЗаданий	
	НоваяСтрока		= МетрикиДобавитьВТаблицуЗначений(ТЗ,
						 ПредопределенноеЗначениеПоИдентификатору("КоличествоПросроченныхЗаданий"),
						 НСтр("ru = 'Количество просроченных заданий'"),
						 ЕдШт,
						 ,
						 НСтр("ru = 'Все не помеченные на удаление задания, просроченные по времени выполнения.'"),
						 ГруппаЗадания);
	ДобавитьКолонкиВИзмерения(НоваяСтрока.Измерения);					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.ГруппыПользователей;Справочник.Пользователи;",
			НСтр("ru = 'Исполнитель'"),
			НСтр("ru = 'Исполнитель задания'"),
			,
			,
			Перечисления.ТипыНазначенияМетрик.Пользователь);
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Клиент'"),
			НСтр("ru = 'Клиент'"));	
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.ПотенциальныеКлиенты;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Инициатор'"),
			НСтр("ru = 'Инициатор задания'"));
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Документ.СоглашениеSLA",
			НСтр("ru = 'Соглашение SLA'"),
			НСтр("ru = 'Соглашение SLA'"));			
	#КонецОбласти
	
	#Область ОбщееКоличествоЗаданий	
	НоваяСтрока		= МетрикиДобавитьВТаблицуЗначений(ТЗ,
						 ПредопределенноеЗначениеПоИдентификатору("ОбщееКоличествоЗаданий"),
						 НСтр("ru = 'Общее количество заданий'"),
						 ЕдШт,
						 ,
						 НСтр("ru = 'Все задания, не помеченные на удаление.'"),
						 ГруппаЗадания);
	ДобавитьКолонкиВИзмерения(НоваяСтрока.Измерения);					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.ПотенциальныеКлиенты;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Инициатор'"),
			НСтр("ru = 'Инициатор задания'"));					 
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.КонтактныеЛица;Справочник.Контрагенты;Справочник.Организации;Справочник.Подразделения;"
			+ "Справочник.Пользователи;Справочник.Сотрудники;Справочник.ФизическиеЛица;",
			НСтр("ru = 'Клиент'"),
			НСтр("ru = 'Клиент'"));
	ДобавитьВТаблицуЗначенийИзмерения(НоваяСтрока.Измерения, 
			"Справочник.ГруппыПользователей;Справочник.Пользователи;",
			НСтр("ru = 'Исполнитель'"),
			НСтр("ru = 'Исполнитель задания'"),
			,
			,
			Перечисления.ТипыНазначенияМетрик.Пользователь);
	#КонецОбласти
	
КонецПроцедуры

// Первоначальное заполнение метрик
//
Процедура ЗаполнитьПриПервоначальномЗаполнении() Экспорт
		
	ТЗ = ТаблицаСтруктураМетрики();	
	ЗаполнитьМетрикиДокументЗадание(ТЗ);	
	ЗаписатьМетрики(ТЗ);
	
КонецПроцедуры

// Запись метрик
//
Процедура ЗаписатьМетрики(ТЗ) Экспорт
	
	Для Каждого Строки Из ТЗ Цикл		
		Объект 			= Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);		
		Объект.Измерения.Очистить();
		Для Каждого Строки2 Из Строки.Измерения Цикл
			НоваяСтрока = Объект.Измерения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строки2);
		КонецЦикла;			
		Объект.Записать();				
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МетрикиДобавитьВТаблицуЗначений(Знач ТЗ, 
										Знач Объект,
										Знач Наименование,
										Знач ЕдиницаИзмерения,
										Знач ЗначениеПоУмолчанию = 0, 
										Знач Описание = "", 
										Знач Родитель)
	
	НоваяСтрока 	   		 		= ТЗ.Добавить();
	НоваяСтрока.Объект 		 		= Объект;
	НоваяСтрока.Наименование 		= Наименование;
	НоваяСтрока.ЕдиницаИзмерения 	= ЕдиницаИзмерения;
	НоваяСтрока.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
	НоваяСтрока.Описание			= Описание;
	НоваяСтрока.Родитель			= Родитель;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ДобавитьКолонкиВИзмерения(Измерения)
	
	Измерения = Новый ТаблицаЗначений;
	Измерения.Колонки.Добавить("ТипИзмерения");
	Измерения.Колонки.Добавить("Представление");
	Измерения.Колонки.Добавить("Подсказка");
	Измерения.Колонки.Добавить("ПоУмолчанию");
	Измерения.Колонки.Добавить("Обязательное");
	Измерения.Колонки.Добавить("Назначение");
	
КонецПроцедуры

Процедура ДобавитьВТаблицуЗначенийИзмерения(ТаблицаИзмерения, 
											Знач ТипИзмерения,
											Знач Представление = "",											
											Знач Подсказка = "",
											Знач ПоУмолчанию = Неопределено,
											Знач Обязательное = Ложь,
											Знач Назначение = Неопределено)
	
	НоваяСтрока 				= ТаблицаИзмерения.Добавить();
	НоваяСтрока.ТипИзмерения 	= ТипИзмерения;
	НоваяСтрока.Представление 	= Представление;
	НоваяСтрока.Подсказка 		= Подсказка;
	Если ПоУмолчанию <> Неопределено Тогда
		НоваяСтрока.ПоУмолчанию = ПоУмолчанию;
	КонецЕсли;
	НоваяСтрока.Обязательное 	= Обязательное;
	Если Назначение <> Неопределено Тогда 
		НоваяСтрока.Назначение = Назначение;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
